# RibbonItemData Properties

---
The RibbonItemData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData)
| LongDescription|  Long description of the command tooltip
| Name|  The internal name of the item. (Inherited from ItemData)
| ToolTip|  The tooltip of item. (Inherited from ItemData)
| ToolTipImage| The image to show as a part of the button extended tooltip
Top
#### Reference
RibbonItemData Class
Autodesk.Revit.UI Namespace